joristork/robots/jobot_in_c/microchip_extras/h/p18f8490.h
extern volatile near unsigned char       TXREG2;
extern volatile near unsigned char       RCREG2;
extern volatile near unsigned char       SPBRG2;
extern volatile near unsigned char       LCDDATA11;
extern volatile near union {
  struct {
    unsigned LCDDATA11:8;
  };
  struct {
    unsigned S40C1:1;
    unsigned S41C1:1;
    unsigned S42C1:1;
    unsigned S43C1:1;
    unsigned S44C1:1;
    unsigned S45C1:1;
    unsigned S46C1:1;
    unsigned S47C1:1;
  };
  struct {
    unsigned SEG40COM1:1;
    unsigned SEG41COM1:1;
    unsigned SEG42COM1:1;
    unsigned SEG43COM1:1;
    unsigned SEG44COM1:1;
    unsigned SEG45COM1:1;
    unsigned SEG46COM1:1;
    unsigned SEG47COM1:1;
  };
} LCDDATA11bits;
extern volatile near unsigned char       LCDDATA12;
extern volatile near union {
  struct {
    unsigned LCDDATA12:8;
  };
  struct {
    unsigned S0C2:1;
    unsigned S1C2:1;
    unsigned S2C2:1;
    unsigned S3C2:1;
    unsigned S4C2:1;
    unsigned S5C2:1;
    unsigned S6C2:1;
    unsigned S7C2:1;
  };
  struct {
    unsigned SEG0COM2:1;
    unsigned SEG1COM2:1;
    unsigned SEG2COM2:1;
    unsigned SEG3COM2:1;
    unsigned SEG4COM2:1;
    unsigned SEG5COM2:1;
    unsigned SEG6COM2:1;
    unsigned SEG7COM2:1;
  };
  struct {
    unsigned S00C2:1;
    unsigned S01C2:1;
    unsigned S02C2:1;
    unsigned S03C2:1;
    unsigned S04C2:1;
    unsigned S05C2:1;
    unsigned S06C2:1;
    unsigned S07C2:1;
  };
} LCDDATA12bits;
extern volatile near unsigned char       LCDDATA13;
extern volatile near union {
  struct {
    unsigned LCDDATA13:8;
  };
  struct {
    unsigned S8C2:1;
    unsigned S9C2:1;
    unsigned S10C2:1;
    unsigned S11C2:1;
    unsigned S12C2:1;
    unsigned S13C2:1;
    unsigned S14C2:1;
    unsigned S15C2:1;
  };
  struct {
    unsigned SEG8COM2:1;
    unsigned SEG9COM2:1;
    unsigned SEG10COM2:1;
    unsigned SEG11COM2:1;
    unsigned SEG12COM2:1;
    unsigned SEG13COM2:1;
    unsigned SEG14COM2:1;
    unsigned SEG15COM2:1;
  };
  struct {
    unsigned S08C2:1;
    unsigned S09C2:1;
  };
} LCDDATA13bits;
extern volatile near unsigned char       LCDDATA14;
extern volatile near union {
  struct {
    unsigned LCDDATA14:8;
  };
  struct {
    unsigned S16C2:1;
    unsigned S17C2:1;
    unsigned S18C2:1;
    unsigned S19C2:1;
    unsigned S20C2:1;
    unsigned S21C2:1;
    unsigned S22C2:1;
    unsigned S23C2:1;
  };
  struct {
    unsigned SEG16COM2:1;
    unsigned SEG17COM2:1;
    unsigned SEG18COM2:1;
    unsigned SEG19COM2:1;
    unsigned SEG20COM2:1;
    unsigned SEG21COM2:1;
    unsigned SEG22COM2:1;
    unsigned SEG23COM2:1;
  };
} LCDDATA14bits;
extern volatile near unsigned char       LCDDATA15;
extern volatile near union {
  struct {
    unsigned LCDDATA15:8;
  };
  struct {
    unsigned S24C2:1;
    unsigned S25C2:1;
    unsigned S26C2:1;
    unsigned S27C2:1;
    unsigned S28C2:1;
    unsigned S29C2:1;
    unsigned S30C2:1;
    unsigned S31C2:1;
  };
  struct {
    unsigned SEG24COM2:1;
    unsigned SEG25COM2:1;
    unsigned SEG26COM2:1;
    unsigned SEG27COM2:1;
    unsigned SEG28COM2:1;
    unsigned SEG29COM2:1;
    unsigned SEG30COM2:1;
    unsigned SEG31COM2:1;
  };
} LCDDATA15bits;
extern volatile near unsigned char       LCDDATA16;
extern volatile near union {
  struct {
    unsigned LCDDATA16:8;
  };
  struct {
    unsigned S32C2:1;
    unsigned S33C2:1;
    unsigned S34C2:1;
    unsigned S35C2:1;
    unsigned S36C2:1;
    unsigned S37C2:1;
    unsigned S38C2:1;
    unsigned S39C2:1;
  };
  struct {
    unsigned SEG32COM2:1;
    unsigned SEG33COM2:1;
    unsigned SEG34COM2:1;
    unsigned SEG35COM2:1;
    unsigned SEG36COM2:1;
    unsigned SEG37COM2:1;
    unsigned SEG38COM2:1;
    unsigned SEG39COM2:1;
  };
} LCDDATA16bits;
extern volatile near unsigned char       LCDDATA17;
extern volatile near union {
  struct {
    unsigned LCDDATA17:8;
  };
  struct {
    unsigned S40C2:1;
    unsigned S41C2:1;
    unsigned S42C2:1;
    unsigned S43C2:1;
    unsigned S44C2:1;
    unsigned S45C2:1;
    unsigned S46C2:1;
    unsigned S47C2:1;
  };
  struct {
    unsigned SEG40COM2:1;
    unsigned SEG41COM2:1;
    unsigned SEG42COM2:1;
    unsigned SEG43COM2:1;
    unsigned SEG44COM2:1;
    unsigned SEG45COM2:1;
    unsigned SEG46COM2:1;
    unsigned SEG47COM2:1;
  };
} LCDDATA17bits;
extern volatile near unsigned char       LCDDATA18;
extern volatile near union {
  struct {
    unsigned LCDDATA18:8;
  };
  struct {
    unsigned S0C3:1;
    unsigned S1C3:1;
    unsigned S2C3:1;
    unsigned S3C3:1;
    unsigned S4C3:1;
    unsigned S5C3:1;
    unsigned S6C3:1;
    unsigned S7C3:1;
  };
  struct {
    unsigned SEG0COM3:1;
    unsigned SEG1COM3:1;
    unsigned SEG2COM3:1;
    unsigned SEG3COM3:1;
    unsigned SEG4COM3:1;
    unsigned SEG5COM3:1;
    unsigned SEG6COM3:1;
    unsigned SEG7COM3:1;
  };
  struct {
    unsigned S00C3:1;
    unsigned S01C3:1;
    unsigned S02C3:1;
    unsigned S03C3:1;
    unsigned S04C3:1;
    unsigned S05C3:1;
    unsigned S06C3:1;
    unsigned S07C3:1;
  };
} LCDDATA18bits;
extern volatile near unsigned char       LCDDATA19;
extern volatile near union {
  struct {
    unsigned LCDDATA19:8;
  };
  struct {
    unsigned S8C3:1;
    unsigned S9C3:1;
    unsigned S10C3:1;
    unsigned S11C3:1;
    unsigned S12C3:1;
    unsigned S13C3:1;
    unsigned S14C3:1;
    unsigned S15C3:1;
  };
  struct {
    unsigned SEG8COM3:1;
    unsigned SEG9COM3:1;
    unsigned SEG10COM3:1;
    unsigned SEG11COM3:1;
    unsigned SEG12COM3:1;
    unsigned SEG13COM3:1;
    unsigned SEG14COM3:1;
    unsigned SEG15COM3:1;
  };
  struct {
    unsigned S08C3:1;
    unsigned S09C3:1;
  };
} LCDDATA19bits;
extern volatile near unsigned char       LCDDATA20;
extern volatile near union {
  struct {
    unsigned LCDDATA20:8;
  };
  struct {
    unsigned S16C3:1;
    unsigned S17C3:1;
    unsigned S18C3:1;
    unsigned S19C3:1;
    unsigned S20C3:1;
    unsigned S21C3:1;
    unsigned S22C3:1;
    unsigned S23C3:1;
  };
  struct {
    unsigned SEG16COM3:1;
    unsigned SEG17COM3:1;
    unsigned SEG18COM3:1;
    unsigned SEG19COM3:1;
    unsigned SEG20COM3:1;
    unsigned SEG21COM3:1;
    unsigned SEG22COM3:1;
    unsigned SEG23COM3:1;
  };
} LCDDATA20bits;
extern volatile near unsigned char       LCDDATA21;
extern volatile near union {
  struct {
    unsigned LCDDATA21:8;
  };
  struct {
    unsigned S24C3:1;
    unsigned S25C3:1;
    unsigned S26C3:1;
    unsigned S27C3:1;
    unsigned S28C3:1;
    unsigned S29C3:1;
    unsigned S30C3:1;
    unsigned S31C3:1;
  };
  struct {
    unsigned SEG24COM3:1;
    unsigned SEG25COM3:1;
    unsigned SEG26COM3:1;
    unsigned SEG27COM3:1;
    unsigned SEG28COM3:1;
    unsigned SEG29COM3:1;
    unsigned SEG30COM3:1;
    unsigned SEG31COM3:1;
  };
} LCDDATA21bits;
extern volatile near unsigned char       LCDDATA22;
extern volatile near union {
  struct {
    unsigned LCDDATA22:8;
  };
  struct {
    unsigned S32C3:1;
    unsigned S33C3:1;
    unsigned S34C3:1;
    unsigned S35C3:1;
    unsigned S36C3:1;
    unsigned S37C3:1;
    unsigned S38C3:1;
    unsigned S39C3:1;
  };
  struct {
    unsigned SEG32COM3:1;
    unsigned SEG33COM3:1;
    unsigned SEG34COM3:1;
    unsigned SEG35COM3:1;
    unsigned SEG36COM3:1;
    unsigned SEG37COM3:1;
    unsigned SEG38COM3:1;
    unsigned SEG39COM3:1;
  };
} LCDDATA22bits;
extern volatile near unsigned char       LCDDATA23;
extern volatile near union {
  struct {
    unsigned LCDDATA23:8;
  };
  struct {
    unsigned S40C3:1;
    unsigned S41C3:1;
    unsigned S42C3:1;
    unsigned S43C3:1;
    unsigned S44C3:1;
    unsigned S45C3:1;
    unsigned S46C3:1;
    unsigned S47C3:1;
  };
  struct {
    unsigned SEG40COM3:1;
    unsigned SEG41COM3:1;
    unsigned SEG42COM3:1;
    unsigned SEG43COM3:1;
    unsigned SEG44COM3:1;
    unsigned SEG45COM3:1;
    unsigned SEG46COM3:1;
    unsigned SEG47COM3:1;
  };
} LCDDATA23bits;
